me.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta name="generator" content=
"HTML Tidy for HTML5 for Apple macOS version 5.8.0">
<!-- 2024-10-15 Tue 08:12 -->
<meta charset="utf-8">
<meta name="viewport" content=
"width=device-width, initial-scale=1">
<title>About +Me+ This Site</title>
<meta name="author" content="RadioNoiseE">
<meta name="generator" content="Org Mode">
<link rel="stylesheet" type="text/css" href="./res/style.css">
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">About <del>Me</del> This Site</h1>
</header>
<nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org30f3f90">1. Who am I</a></li>
<li><a href="#orgdf4487f">2. About This Site</a></li>
</ul>
</div>
</nav>
<div id="outline-container-org30f3f90" class="outline-2">
<h2 id="org30f3f90"><span class="section-number-2">1.</span> Who am
I</h2>
<div class="outline-text-2" id="text-1">
<p>Ordinary IB student studying at WFLA. Learning Formal Proof,
Type Theory and PLT.</p>
<p>I care about tools.</p>
<p>You can reach me at <a href=
"mailto:RadioNoiseE@gmail.com"><code>RadioNoiseE@gmail.com</code></a>.
I may be slow to respond as my Gmail is not frequently checked.</p>
</div>
</div>
<div id="outline-container-orgdf4487f" class="outline-2">
<h2 id="orgdf4487f"><span class="section-number-2">2.</span> About
This Site</h2>
<div class="outline-text-2" id="text-2">
<p>Build using Emacs with alien technology. Recently migrated from
XHTML 1.0 Strict to HTML 5.0. Clean static web pages.</p>
<p>This site archives my articles, and (at present) most of them
are written in Mandarin Chinese. However, future articles may be
written in English. You should be able to distinguish between them
without pain from the entry names.</p>
<p>I write about Emacs, TeX, DocBook XSLT, Unix tools, Gentoo
Linux, Mach-O, C/C++, OCaML, PL, Formal Proof (Coq), Type Theory
and PLT. Despite CS, I may also write about
<ruby>アニメ<rt>Anime</rt></ruby> and Galgames.</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: RadioNoiseE</p>
<p class="date">Created: 2024-10-15 Tue 08:12</p>
<p class="validation"><a href=
"https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
